app/controllers/attendances_controller.rb

  def create
    @event = Event.find(params[:event_id])
    @attendance = Attendance.new(participant_id: current_user.id,
                                 event_id: params[:event_id])
    if @attendance.save
      customer = Stripe::Customer.create({
        email: params[:stripeEmail],
        source: params[:stripeToken],
      })

      charge = Stripe::Charge.create({
        customer: customer.id,
        amount: Event.find(params[:event_id]).price,
        description: 'Rails Stripe customer',
        currency: 'eur',
      })
---
INSERT INTO "attendances" ("participant_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["participant_id", 21], ["event_id", 10], ["created_at", "2019-08-14 22:43:09.779727"], ["updated_at", "2019-08-14 22:43:09.779727"]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]