app/controllers/attendances_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def new
    @attendance = Attendance.new
    @price = Event.find(params[:event_id]).price

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances"
---
  def index
    @event = Event.find(params[:event_id])
    @attendances = Attendance.all

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "attendances" ("stripe_customer_id", "participant_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "cus_FczrOBxjy9y8sA"], ["participant_id", 21], ["event_id", 10], ["created_at", "2019-08-15 14:23:57.003165"], ["updated_at", "2019-08-15 14:23:57.003165"]]
---
  def create
    puts "You are in the create method"
    puts "*"*40
    @event = Event.find(params[:event_id])

    customer = Stripe::Customer.create({
        email: params[:stripeEmail],
        source: params[:stripeToken],
      })

    charge = Stripe::Charge.create({
        customer: customer.id,
        amount: @event.price,
        description: 'Rails Stripe customer',
        currency: 'eur',
      })

    @attendance = Attendance.new(participant_id: current_user.id,
                                 event_id: params[:event_id],
                               stripe_customer_id: charge.customer)

    if @attendance.save